digitalloggers/plduino-arduinoide-package/PLDuinoAVR/boards.txt
PLDuinoAVR.name=PLDuino/Mega2560
PLDuinoAVR.vid.0=0x2341
PLDuinoAVR.pid.0=0x0010
PLDuinoAVR.vid.1=0x2341
PLDuinoAVR.pid.1=0x0042
PLDuinoAVR.vid.2=0x2A03
PLDuinoAVR.pid.2=0x0010
PLDuinoAVR.vid.3=0x2A03
PLDuinoAVR.pid.3=0x0042
PLDuinoAVR.vid.4=0x2341
PLDuinoAVR.pid.4=0x0210
PLDuinoAVR.vid.5=0x2341
PLDuinoAVR.pid.5=0x0242

PLDuinoAVR.upload.tool=arduino:avrdude
PLDuinoAVR.upload.maximum_data_size=8192
PLDuinoAVR.upload.protocol=wiring
PLDuinoAVR.upload.maximum_size=253952
PLDuinoAVR.upload.speed=115200

PLDuinoAVR.bootloader.tool=arduino:avrdude
PLDuinoAVR.bootloader.low_fuses=0xFF
PLDuinoAVR.bootloader.high_fuses=0xD8
PLDuinoAVR.bootloader.extended_fuses=0xFD
PLDuinoAVR.bootloader.unlock_bits=0x3F
PLDuinoAVR.bootloader.lock_bits=0x0F
PLDuinoAVR.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex

PLDuinoAVR.build.f_cpu=16000000L
PLDuinoAVR.build.core=arduino:arduino
PLDuinoAVR.build.variant=PLDuinoAVR
PLDuinoAVR.build.board=AVR_MEGA2560
PLDuinoAVR.build.mcu=atmega2560
